# Pandas

### Pandas - Open source library
### Data manipulation and analysis

In [1]:
### importing  pandas
import pandas as pd
import numpy as np

### Series - One dimensional
### dataframe-Multi dimensional

In [2]:
age=pd.Series([19,24,30,41,53])
age

0    19
1    24
2    30
3    41
4    53
dtype: int64

In [3]:
## Alternate number
age=pd.Series(np.array([13,20,55,80,66]))
age

0    13
1    20
2    55
3    80
4    66
dtype: int32

In [4]:
num=pd.Series(np.array([19,24,30,41,53]))
num

0    19
1    24
2    30
3    41
4    53
dtype: int32

In [5]:
list1=[19,20,30,40]

In [6]:
pd.Series(list1)

0    19
1    20
2    30
3    40
dtype: int64

In [7]:
pd.Series(np.array(list1))

0    19
1    20
2    30
3    40
dtype: int32

In [8]:
pd.Series(data=[20,12,43,45,65,66],index=[0,2,4,6,8,10])

0     20
2     12
4     43
6     45
8     65
10    66
dtype: int64

In [9]:
age=pd.Series(np.array([20,12,43,45,55,66]),index=np.arange(0,12,2))
age

0     20
2     12
4     43
6     45
8     55
10    66
dtype: int32

In [10]:
var2=pd.Series(np.array([20,12,43,45,55,65]),index=['a1','a2','a3','a4','a5','a6'])

In [11]:
var2

a1    20
a2    12
a3    43
a4    45
a5    55
a6    65
dtype: int32

In [12]:
var2=pd.Series(data=([20,12,43,45,55,65]),index=['a1','a2','a3','a4','a5','a6'])

In [13]:
var2

a1    20
a2    12
a3    43
a4    45
a5    55
a6    65
dtype: int64

In [14]:
prod=pd.Series(np.array([23000,45000,67000]),index=("dairy","soft drinks","fv"))

In [15]:
prod

dairy          23000
soft drinks    45000
fv             67000
dtype: int32

In [16]:
### using dict method {}
prod={"dairy":23000,"soft drink":45000,"fv":65000}
prod1=pd.Series(prod)

In [17]:
prod1

dairy         23000
soft drink    45000
fv            65000
dtype: int64

In [18]:
sub={'x':["maths,science,english"],'y':["maths,english"],'z':["science"]}
sub1=pd.Series(sub)
sub1

x    [maths,science,english]
y            [maths,english]
z                  [science]
dtype: object

In [19]:
sub1.values

array([list(['maths,science,english']), list(['maths,english']),
       list(['science'])], dtype=object)

In [20]:
sub1.index

Index(['x', 'y', 'z'], dtype='object')

In [21]:
xyx=np.array(['a1','a2','a3','a4','a5','a6','a7'])
xyx

array(['a1', 'a2', 'a3', 'a4', 'a5', 'a6', 'a7'], dtype='<U2')

In [22]:
xyx_series=pd.Series(xyx)
xyx_series

0    a1
1    a2
2    a3
3    a4
4    a5
5    a6
6    a7
dtype: object

In [23]:
xyx_series[:5]

0    a1
1    a2
2    a3
3    a4
4    a5
dtype: object

In [24]:
xyx_series[4:-1]

4    a5
5    a6
dtype: object

In [25]:
xyx_series[:-0]

Series([], dtype: object)

In [26]:
sub={'x':["maths,science,english"],'y':["maths,english"],'z':["science"]}
sub1=pd.Series(sub)
sub1

x    [maths,science,english]
y            [maths,english]
z                  [science]
dtype: object

In [27]:
sub1[:1]

x    [maths,science,english]
dtype: object

In [28]:
sub1[:2]

x    [maths,science,english]
y            [maths,english]
dtype: object

In [29]:
sub1["x","y"] ### single bracket == error

KeyError: 'key of type tuple not found and not a MultiIndex'

In [30]:
sub1[["x","y"]]  ### double bracket is needed

x    [maths,science,english]
y            [maths,english]
dtype: object

In [31]:
table2={"sophia":450,"mia":303,"phillip":432,"ema":150,"lily":293,"grace":112}
table1=pd.Series(table2)
table1

sophia     450
mia        303
phillip    432
ema        150
lily       293
grace      112
dtype: int64

In [32]:
pd.Series(data=[450,303,432,150,293,112],index=("sophia","mia","phillip","emma","lilly",'grace'))

sophia     450
mia        303
phillip    432
emma       150
lilly      293
grace      112
dtype: int64

In [33]:
stud4=pd.Series(np.array([450,303,432,150,293,112]),index=("sophia","mia","phillip","emma","lilly",'grace'))

In [34]:
stud4

sophia     450
mia        303
phillip    432
emma       150
lilly      293
grace      112
dtype: int32

In [35]:
stud4[stud4>200] ### for greater than any specific  number

sophia     450
mia        303
phillip    432
lilly      293
dtype: int32

In [36]:
stud4[stud4<200]   ### for lesser than any specific  number

emma     150
grace    112
dtype: int32

In [37]:
stud4[200>stud4<300]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [ ]:
stud4[(stud4>200)&(stud4<300)]

In [ ]:
#### concatenation
class1=np.linspace(0,20,11) ## linspace=> equualy distribtion
class1

In [ ]:
class2=np.linspace(1,21,11)
class2

In [ ]:
print(class1)
print(class2)

In [ ]:
class1_series=pd.Series(class1)
class2_series=pd.Series(class2)

In [ ]:
class1_series
class2_series

In [ ]:
pd.concat([class1_series,class2_series])  ### joins two series=> concatenate

In [ ]:
pd.concat([class1_series,class2_series],keys=["even","odd"])

In [ ]:
pd.concat([class1_series,class2_series],keys=["even","odd"],names=["category","index"])

In [ ]:
### even and odd are only names of rows and 'nmaes' are given to  keys

In [ ]:
class1_series.append(class2_series,ignore_index=True)

In [ ]:
 #### Dataframe

In [ ]:
import pandas as pd

In [48]:
pd1=pd.DataFrame({"month":["jan","jan","jun","jun","jan","feb","feb","feb","feb","mar"],
                 "store":["A","B","C","D","E","F","G","h","I","J"],
                 "SALES":[300,500,600,700,800,900,500,600,700,800]})
pd1

  month store  SALES
0   jan     A    300
1   jan     B    500
2   jun     C    600
3   jun     D    700
4   jan     E    800
5   feb     F    900
6   feb     G    500
7   feb     h    600
8   feb     I    700
9   mar     J    800

In [49]:
pd2=pd.DataFrame(pd1)
pd2                   #### both ways can be done either  ^ or this

  month store  SALES
0   jan     A    300
1   jan     B    500
2   jun     C    600
3   jun     D    700
4   jan     E    800
5   feb     F    900
6   feb     G    500
7   feb     h    600
8   feb     I    700
9   mar     J    800

In [50]:
pd2.tail()

  month store  SALES
5   feb     F    900
6   feb     G    500
7   feb     h    600
8   feb     I    700
9   mar     J    800

In [51]:
pd2.head()

  month store  SALES
0   jan     A    300
1   jan     B    500
2   jun     C    600
3   jun     D    700
4   jan     E    800

In [52]:
pd2.shape

(10, 3)

In [53]:
df1=pd2

In [54]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   month   10 non-null     object
 1   store   10 non-null     object
 2   SALES   10 non-null     int64
dtypes: int64(1), object(2)
memory usage: 368.0+ bytes

In [55]:
df1.dtypes

month    object
store    object
SALES     int64
dtype: object

#### .iloc =>  Retrievs rows and column  by index
####  .loc =>  retrievs rows and column by name

In [56]:
df1.iloc[0]

month    jan
store      A
SALES    300
Name: 0, dtype: object

In [57]:
df1.iloc[6]

month    feb
store      G
SALES    500
Name: 6, dtype: object

In [58]:
df1.iloc[1:5] #### 5 not includes

  month store  SALES
1   jan     B    500
2   jun     C    600
3   jun     D    700
4   jan     E    800

In [59]:
df1.iloc[1]['store']

'B'

In [60]:
df1.iloc[2:9]

  month store  SALES
2   jun     C    600
3   jun     D    700
4   jan     E    800
5   feb     F    900
6   feb     G    500
7   feb     h    600
8   feb     I    700

In [61]:
df1.iloc[:2] #### 2 not included

  month store  SALES
0   jan     A    300
1   jan     B    500

In [62]:
df1.iloc[:]['store']

0    A
1    B
2    C
3    D
4    E
5    F
6    G
7    h
8    I
9    J
Name: store, dtype: object

In [63]:
df1.iloc[:,1:]

  store  SALES
0     A    300
1     B    500
2     C    600
3     D    700
4     E    800
5     F    900
6     G    500
7     h    600
8     I    700
9     J    800

In [64]:
df1.iloc[:,:1]

  month
0   jan
1   jan
2   jun
3   jun
4   jan
5   feb
6   feb
7   feb
8   feb
9   mar

In [65]:
df1.iloc[:,:2]

  month store
0   jan     A
1   jan     B
2   jun     C
3   jun     D
4   jan     E
5   feb     F
6   feb     G
7   feb     h
8   feb     I
9   mar     J

In [66]:
df1.iloc[:,[0,2]]

  month  SALES
0   jan    300
1   jan    500
2   jun    600
3   jun    700
4   jan    800
5   feb    900
6   feb    500
7   feb    600
8   feb    700
9   mar    800

In [67]:
df1.iloc[1]['SALES']

500

In [68]:
df1.loc[1]['SALES']

500

In [69]:
df1.loc[:2]['store']

0    A
1    B
2    C
Name: store, dtype: object

In [70]:
df1.loc[[0,1,2],["store","SALES"]]  ### doubt created

  store  SALES
0     A    300
1     B    500
2     C    600

In [71]:
#### sales > 500

In [72]:
df1[df1.SALES>500]

  month store  SALES
2   jun     C    600
3   jun     D    700
4   jan     E    800
5   feb     F    900
7   feb     h    600
8   feb     I    700
9   mar     J    800

In [73]:
# Get the january month sale whwn greater than 500
df1[(df1.month=='jan')&(df1.SALES>500)]

  month store  SALES
4   jan     E    800

In [74]:
#### one question & solution

In [75]:
df1.sort_values("SALES")

  month store  SALES
0   jan     A    300
1   jan     B    500
6   feb     G    500
2   jun     C    600
7   feb     h    600
3   jun     D    700
8   feb     I    700
4   jan     E    800
9   mar     J    800
5   feb     F    900

In [76]:
df1.sort_values("SALES",ascending=False)

  month store  SALES
5   feb     F    900
4   jan     E    800
9   mar     J    800
3   jun     D    700
8   feb     I    700
2   jun     C    600
7   feb     h    600
1   jan     B    500
6   feb     G    500
0   jan     A    300

In [77]:
df1.isna().sum()  ### for missing values

month    0
store    0
SALES    0
dtype: int64